IRP/src/Catalogs/ItemTypes/ItemTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ItemTypes</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.ItemTypes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AvailableAttributes</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>AffectPricing</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Required</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ShowInHTML</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/ItemTypes/ManagerModule.bsl
Procedure SetDataLock(DataLock, ItemType)
	DataSource = New ValueTable();
	DataSource.Columns.Add("Ref", New TypeDescription("CatalogRef.ItemTypes"));
	DataSource.Add().Ref = ItemType;
	
	ItemLock = DataLock.Add("Catalog.ItemTypes");
	ItemLock.Mode = DataLockMode.Exclusive;
	ItemLock.DataSource = DataSource;
	ItemLock.UseFromDataSource("Ref", "Ref");
	DataLock.Lock();
EndProcedure

Procedure AddAvailableAttribute(ItemType, Attribute) Export
	If Not TransactionActive() Then
		BeginTransaction(DataLockControlMode.Managed);
		Try
			AddDataToObject(ItemType, Attribute);
			If TransactionActive() Then
				CommitTransaction();
			EndIf;
		Except
			If TransactionActive() Then
				RollbackTransaction();
			EndIf;
		EndTry;
	Else
		AddDataToObject(ItemType, Attribute);
	EndIf;
EndProcedure

Procedure AddDataToObject(ItemType, Attribute)
	DataLock = New DataLock();
	SetDataLock(DataLock, ItemType);
	
	CatalogObject = ItemType.GetObject();
	Filter = New Structure("Attribute", Attribute);
	ArrayOfRows = CatalogObject.AvailableAttributes.FindRows(Filter);
	If Not ArrayOfRows.Count() Then
		NewRow = CatalogObject.AvailableAttributes.Add();
		NewRow.Attribute = Attribute;
		CatalogObject.Write();
	EndIf;
EndProcedure

Procedure DeleteAvailableAttribute(ItemType, Attribute) Export
	If Not TransactionActive() Then
		BeginTransaction(DataLockControlMode.Managed);
		Try
			DeleteDataFromObject(ItemType, Attribute);
			If TransactionActive() Then
				CommitTransaction();
			EndIf;
		Except
			If TransactionActive() Then
				RollbackTransaction();
			EndIf;
		EndTry;
	Else
		DeleteDataFromObject(ItemType, Attribute);
	EndIf;
EndProcedure

Procedure DeleteDataFromObject(ItemType, Attribute)
	DataLock = New DataLock();
	SetDataLock(DataLock, ItemType);
	
	CatalogObject = ItemType.GetObject();
	Filter = New Structure("Attribute", Attribute);
	ArrayOfRows = CatalogObject.AvailableAttributes.FindRows(Filter);
	For Each Row In ArrayOfRows Do
		CatalogObject.AvailableAttributes.Delete(Row);
	EndDo;
	If ArrayOfRows.Count() Then
		CatalogObject.Write();
	EndIf;
EndProcedure
